In [70]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pl
import operator
from rake_nltk import Rake
from nltk.corpus import stopwords
# to disable a warning that had no point(raising an error because of slicing a dataframe on this way).
pd.options.mode.chained_assignment = None  # default='warn'

In [2]:
#Loading data
books = pd.read_csv('BX-Books.csv', sep=';', error_bad_lines=False, encoding="latin-1")
books.columns = ['ISBN', 'bookTitle', 'bookAuthor', 'yearOfPublication', 'publisher', 'imageUrlS', 'imageUrlM', 'imageUrlL']
users = pd.read_csv('BX-Users.csv', sep=';', error_bad_lines=False, encoding="latin-1")
users.columns = ['userID', 'Location', 'Age']
ratings = pd.read_csv('BX-Book-Ratings.csv', sep=';', error_bad_lines=False, encoding="latin-1")
ratings.columns = ['userID', 'ISBN', 'bookRating']

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
c:\users\marios\appdata\local\programs\python\python37\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
# PRE PROCESSING OVER THE DATA SET 
#dropping last three columns containing image URLs which will not be required for analysis.
books.drop(['imageUrlS', 'imageUrlM', 'imageUrlL'],axis=1,inplace=True)

In [4]:
#ratings dataset should have books only which exist in our books dataset, unless new books are added to books dataset
ratings_new = ratings[ratings.ISBN.isin(books.ISBN)]
print (ratings.shape)
print (ratings_new.shape)
#it can be seen that many rows having book ISBN not part of books dataset got dropped off

(1149780, 3)
(1031136, 3)

In [5]:
#ratings dataset should have ratings from users which exist in users dataset, unless new users are added to users dataset
ratings_new = ratings[ratings.userID.isin(users.userID)]
print (ratings.shape)
print (ratings_new.shape)
#no new users added, hence we will go with above dataset ratings_new (1031136, 3)

(1149780, 3)
(1149780, 3)

In [6]:
# removing the ratins books that don't exist on books dataframe. 
ratings = ratings[ratings.ISBN.isin(books.ISBN)]

In [7]:
books.yearOfPublication.unique()
#investigating the rows having 'DK Publishing Inc' as yearOfPublication
books.loc[books.yearOfPublication == 'DK Publishing Inc',:]
#From above, it is seen that bookAuthor is incorrectly loaded with bookTitle, hence making required corrections
#ISBN '0789466953'
books.loc[books.ISBN == '0789466953','yearOfPublication'] = 2000
books.loc[books.ISBN == '0789466953','bookAuthor'] = "James Buckley"
books.loc[books.ISBN == '0789466953','publisher'] = "DK Publishing Inc"
books.loc[books.ISBN == '0789466953','bookTitle'] = "DK Readers: Creating the X-Men, How Comic Books Come to Life (Level 4: Proficient Readers)"
#ISBN '078946697X'
books.loc[books.ISBN == '078946697X','yearOfPublication'] = 2000
books.loc[books.ISBN == '078946697X','bookAuthor'] = "Michael Teitelbaum"
books.loc[books.ISBN == '078946697X','publisher'] = "DK Publishing Inc"
books.loc[books.ISBN == '078946697X','bookTitle'] = "DK Readers: Creating the X-Men, How It All Began (Level 4: Proficient Readers)"

In [8]:
#rechecking
books.loc[(books.ISBN == '0789466953') | (books.ISBN == '078946697X'), :]
#corrections done

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
209538,078946697X,"DK Readers: Creating the X-Men, How It All Beg...",Michael Teitelbaum,2000,DK Publishing Inc
221678,0789466953,"DK Readers: Creating the X-Men, How Comic Book...",James Buckley,2000,DK Publishing Inc

In [9]:
#investigating the rows having 'Gallimard' as yearOfPublication
books.loc[books.yearOfPublication == 'Gallimard',:]

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
220731,2070426769,"Peuple du ciel, suivi de 'Les Bergers\"";Jean-M...",2003,Gallimard,http://images.amazon.com/images/P/2070426769.0...

In [10]:
#making required corrections as above, keeping other fields intact
books.loc[books.ISBN == '2070426769','yearOfPublication'] = 2003
books.loc[books.ISBN == '2070426769','bookAuthor'] = "Jean-Marie Gustave Le ClÃ?Â©zio"
books.loc[books.ISBN == '2070426769','publisher'] = "Gallimard"
books.loc[books.ISBN == '2070426769','bookTitle'] = "Peuple du ciel, suivi de 'Les Bergers"

In [11]:
#rechecking
books.loc[books.ISBN == '2070426769',:]
#corrections done

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
220731,2070426769,"Peuple du ciel, suivi de 'Les Bergers",Jean-Marie Gustave Le ClÃ?Â©zio,2003,Gallimard

In [12]:
#Correcting the dtypes of yearOfPublication
books.yearOfPublication=pd.to_numeric(books.yearOfPublication, errors='coerce')

In [13]:
# However, the value 0 is invalid and as this dataset was published in 2004, I have assumed the the years after 2005 to be 
# invalid keeping some margin in case dataset was updated thereafer
# setting invalid years as NaN
books.loc[(books.yearOfPublication > 2005) | (books.yearOfPublication == 0),'yearOfPublication'] = np.NAN

In [14]:
#replacing NaNs with mean value of yearOfPublication
books.yearOfPublication.fillna(round(books.yearOfPublication.mean()), inplace=True)

In [15]:
#rechecking
books.yearOfPublication.isnull().sum()
#resetting the dtype as int32
books.yearOfPublication = books.yearOfPublication.astype(np.int32)

In [16]:
#exploring 'bookAuthor' column
books.loc[books.bookAuthor.isnull(),:]

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
187689,9627982032,The Credit Suisse Guide to Managing Your Perso...,NaN,1995,Edinburgh Financial Publishing

In [17]:
# I've searched and found that link on amazon https://www.amazon.com/Credit-Suisse-Managing-Personal-International/dp/9627982075
# and the author is also the publisher so I changed it.
books.loc[books.ISBN == '9627982032','bookAuthor'] = 'Edinburgh Financial Publishing'

# END OF PRE PROCESSING

In [18]:
# remove all books that have less than 10 ratings
# count all the books.
count_books = ratings['ISBN'].value_counts()
# apply .map() function with Series count on each element to remove all books that have less than 10 ratings and 
# assign it to a new variable to keep ratings untouched
ratings = ratings[ratings['ISBN'].map(count_books) >= 10]
ratings

         userID        ISBN  bookRating
0        276725  034545104X           0
2        276727  0446520802           0
8        276744  038550120X           7
10       276746  0425115801           0
11       276746  0449006522           0
...         ...         ...         ...
1149771  276704  0743211383           7
1149772  276704  080410526X           0
1149776  276706  0679447156           0
1149777  276709  0515107662          10
1149778  276721  0590442449          10

[520499 rows x 3 columns]

In [19]:
#group by ISBN in order to do the join with books to remove all the books that have less than 10 ratings
# temp_ratings is a dictionary that contains a key as the ISBN and a dataframe that contains all 
temp_ratings = ratings.groupby(['ISBN'])

In [20]:
# getting dict_keys from temp_ratings then cast it into list in order to make it Series to join it with books
keys_Series = pd.Series(list(temp_ratings.groups.keys()))
# make a dataframe so I can name the column as ISBN to inner join it with books
frame = {'ISBN': keys_Series}
df_uniqueISBN = pd.DataFrame(frame)

In [21]:
# final df for books
books_over10= pd.merge(left=books, right=df_uniqueISBN, how='inner', left_on='ISBN', right_on='ISBN')
books_over10

,ISBN,bookTitle,bookAuthor,yearOfPublication,publisher
0,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
1,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
2,0399135782,The Kitchen God's Wife,Amy Tan,1991,Putnam Pub Group
3,0440234743,The Testament,John Grisham,1999,Dell
4,0452264464,Beloved (Plume Contemporary Fiction),Toni Morrison,1994,Plume
...,...,...,...,...,...
17474,3803112133,Cosi fan tutte. Eine Geschichte.,Alan Bennett,2003,Wagenbach
17475,006019250X,The Illustrated Alchemist: A Fable About Follo...,Paulo Coelho,1998,HarperCollins Publishers
17476,0786890088,The Angel Maker,Ridley Pearson,2001,Hyperion Press
17477,006447027X,The Endless Steppe (rack) : Growing Up in Siberia,Esther Hautzig,1987,HarperTrophy
17478,0330353349,The Ice House (TV Tie-In Edition),Minette Walters,1997,McClelland &amp; Stewart

In [22]:
# count all the users.
count_users = ratings['userID'].value_counts()
# apply .map() function with Series count on each element to remove all books that have less than 5 userID and 
# assign it to a new variable to keep ratings untouched
ratings = ratings[ratings['userID'].map(count_users) >= 5]

In [23]:
#group by ISBN in order to do the join with books to remove all the books that have less than 10 ratings
# temp_ratings is a dictionary that contains a key as the ISBN and a dataframe that contains all 
temp_ratings = ratings.groupby(['userID'])
# getting dict_keys from temp_ratings then cast it into list in order to make it Series to join it with users
keys_Series = pd.Series(list(temp_ratings.groups.keys()))
# make a dataframe so I can name the column as userID to inner join it with books
frame = {'userID': keys_Series}
df_uniqueuserID = pd.DataFrame(frame)

In [24]:
# final df for users
user_over5= pd.merge(left=users, right=df_uniqueuserID, how='inner', left_on='userID', right_on='userID')
user_over5

       userID                              Location   Age
0          17             chesapeake, virginia, usa   NaN
1          99              franktown, colorado, usa  42.0
2         114           ligonier, pennsylvania, usa  57.0
3         165              olympia, washington, usa  62.0
4         242  neuffen, baden-wuerttemberg, germany  37.0
...       ...                                   ...   ...
13399  278723            prior lake, minnesota, usa  52.0
13400  278771             milford, connecticut, usa   NaN
13401  278843          pismo beach, california, usa  28.0
13402  278851                    dallas, texas, usa  33.0
13403  278854                 portland, oregon, usa   NaN

[13404 rows x 3 columns]

In [25]:
# initialize the new column of keywords.
# pre processing for adding keywords for each title.
books_over10['Keywords'] = ""
r = Rake() # Uses stopwords for english from NLTK, and all puntuation characters.
for index, row in books_over10.iterrows():
    a=r.extract_keywords_from_text(row['bookTitle'])
    # b=r.get_ranked_phrases() # To get keyword phrases ranked highest to lowest. 
    c=r.get_ranked_phrases() # To get keyword phrases ranked with scores highest to lowest.
    books_over10.at[index, 'Keywords'] = c

In [26]:
# pd.set_option('display.max_rows', 30) # display 30 rows
# pd.set_option('display.max_columns', 5)
books_over10.Keywords.head()

0                                       [clara callan]
1    [great influenza pandemic, virus, story, searc...
2                                  [kitchen god, wife]
3                                          [testament]
4                [plume contemporary fiction, beloved]
Name: Keywords, dtype: object

In [39]:
## START OF RECOMMENDER SYSTEM.
def getRecommendations(new):
    random_users = new['userID'].tolist()
    new_ratings_grouped = ratings.groupby('userID')
    for index, userID in enumerate(random_users):
        # getting the data frame 
        current_users_ratings = get_group(new_ratings_grouped, userID)
        # get the column with ISBN'S to exclude them from the search.
        excluded_ISBNS = current_users_ratings['ISBN']
        # get the 3 maximum values out of bookRating column.
        df_most_rated_books = current_users_ratings.nlargest(3, ['bookRating'])
        # inner join to get the bookAuthor, Keywords and year.
        most_rated_books = pd.merge(left=df_most_rated_books, right=books_over10, how='inner', left_on='ISBN', right_on='ISBN')
        profile = most_rated_books[['bookAuthor','yearOfPublication','Keywords']]
        # Get every column as Series, turn it into list and then cast it into set.
        years = set(profile['yearOfPublication'].tolist())
        Authors = set(profile['bookAuthor'].tolist())
        Keywords = profile['Keywords'].tolist()
        # Use list comprehension to convert a list of lists to a flat list and then to a set.
        KeywordsList = [item for elem in Keywords for item in elem]
        KeywordsSet = set(KeywordsList)
        # include the books with ISBNS that are NOT (~) currently in column isbn.
        excluded_books_over10 = books_over10.loc[~books_over10['ISBN'].isin(excluded_ISBNS)]
        # print(years,Authors,KeywordsSet)
        CalculateSimilarities(years, Authors, KeywordsSet, excluded_books_over10,index)

In [63]:
# a function that takes as input a  grouped_by dataframe and a key according to grouped, and returns the dataframe 
# that is connected to current key.
def get_group(group_df, key):
     if key in group_df.groups: return group_df.get_group(key)
     return pd.DataFrame()
def CalculateSimilarities(years, Authors, KeywordsSet, excluded_books_over10, curr_user):
    # the below list comprehension takes every yearofPublication of all books then takes
    # every year as y in years from 3 most rated, calculating the difference and saves the max.
    year_diff = [max([(1-(np.absolute(x-y)/2005)) for y in years]) for x in excluded_books_over10['yearOfPublication']]
    jac_sim = [len(KeywordsSet.intersection(set(x))) / len(KeywordsSet.union(x)) for x in excluded_books_over10['Keywords']]
    # check if any of most rated Authors are in the books. if it is set it 1 otherwise 0.
    Author = [1 if Author in Authors else 0 for Author in excluded_books_over10['bookAuthor']]
    # calculate 
    final_scoreJ = [0.2*jaccard + 0.4*max_year + 0.4*Auth for max_year, jaccard, Auth in zip(year_diff, jac_sim, Author)]
    # get the sorted list with the original indexes also, 
    # then take only the last ten(maximum) elements of each and reverse the list to get them in the right order.
    indices, final_score_sorted = zip(*sorted(enumerate(final_scoreJ), key=operator.itemgetter(1)))
    max_indicesJ = list(indices[-10:])
    max_indicesJ.reverse()
    max_scoresJ = list(final_score_sorted[-10:])
    max_scoresJ.reverse()
    user = 'JaccardOutput' + str(curr_user+1) + '.xlsx'
    # set scoresj_df into a dataframe that contains only the top ten books according to max_indices for jaccard similarity.
    scoresj_df = excluded_books_over10.iloc[max_indicesJ[0:10]]
    # set a new column named JaccardScores to keep the scores.
    scoresj_df['JaccardScores'] = max_scoresJ
    scoresj_df.to_excel(user)
    # DO THE SAME AS ABOVE WITH DICE COEFFICIENT INSTEAD.
    dice_sim = [2*len(KeywordsSet.intersection(set(x))) / (len(KeywordsSet) + len(set(x))) for x in excluded_books_over10['Keywords']]
    final_scoreD = [0.5*dice_coef + 0.2*max_year + 0.3*Auth for max_year, dice_coef, Auth in zip(year_diff, dice_sim, Author)]
    indices, final_score_sorted = zip(*sorted(enumerate(final_scoreD), key=operator.itemgetter(1)))
    max_indicesC = list(indices[-10:])
    max_indicesC.reverse()
    max_scoresC = list(final_score_sorted[-10:])
    max_scoresC.reverse()
    user = 'DiceCoefOutput' + str(curr_user+1) + '.xlsx'
    # set scoresC_df into a dataframe that contains only the top ten books according to max_indices for dice coeff.
    scoresc_df = excluded_books_over10.iloc[max_indicesC[0:10]]
    # set a new column named JaccardScores to keep the scores.
    scoresc_df['DiceCoefScores'] = max_scoresC
    scoresc_df.to_excel(user)

In [71]:
new = user_over5.sample(1)
getRecommendations(new)